#### `terraform plan` Success
<details><summary>Show Output</summary>

```
b]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_container_read_policy: Refreshing state... [id=eks-node-group-service-20210718215214601100000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.kubernetes.aws_internet_gateway.gateway: Refreshing state... [id=igw-072010f2418cb3795]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=ERG8JFP6OLXF]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=151240493]
module.kubernetes.aws_eks_cluster.fluentlabs: Refreshing state... [id=fluentlabsprod]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E32KMXMEZQQYJK]
module.kubernetes.aws_route_table.route_table: Refreshing state... [id=rtb-05eec23c01822e230]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/www.fluentlabs.io-deploy-role]
module.kubernetes.aws_eks_addon.vpc_cni: Refreshing state... [id=fluentlabsprod:vpc-cni]
module.kubernetes.aws_eks_node_group.services: Refreshing state... [id=fluentlabsprod:services]
module.kubernetes.aws_eks_node_group.jobs: Refreshing state... [id=fluentlabsprod:jobs]
module.kubernetes.aws_eks_addon.kube_proxy: Refreshing state... [id=fluentlabsprod:kube-proxy]
module.kubernetes.aws_eks_addon.coredns: Refreshing state... [id=fluentlabsprod:coredns]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/preprod.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.fluentlabs.io-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version = "v1.7.5-eksbuild.2" -> "v1.9.0-eksbuild.1"
        id            = "fluentlabsprod:vpc-cni"
        tags          = {}
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes.aws_eks_cluster.fluentlabs will be updated in-place
  ~ resource "aws_eks_cluster" "fluentlabs" {
        id                        = "fluentlabsprod"
        name                      = "fluentlabsprod"
        tags                      = {}
      ~ version                   = "1.20" -> "1.21"
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.infrastructure.module.api.kubernetes_deployment.api is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "default/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ resource_version = "829760" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "b9f16c1f-fe17-4c7b-862d-b1b8064860df" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_LEARNERS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_SPANISH_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "elasticsearch-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_URL"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_USERNAME"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_AUDIENCE"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_DOMAIN"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      ~ volume_mount {
                            name              = "flrcredentials"
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged blocks hidden)
                    }


                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  ~ volume {
                        name = "flrcredentials"

                      ~ secret {
                          - optional     = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                    # (1 unchanged block hidden)
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.content.kubernetes_deployment.prefect is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "prefect" {
      ~ id               = "default/prefect-agent" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
            name             = "prefect-agent"
          ~ resource_version = "829751" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "6119dae7-9472-442e-8301-5c8141416122" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    # (10 unchanged attributes hidden)

                  ~ container {
                        name                       = "agent"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (8 unchanged attributes hidden)

                      ~ env {
                            name = "PREFECT__CLOUD__AGENT__AUTH_TOKEN"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "prefect-auth"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                        # (13 unchanged blocks hidden)
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "language_service" {
      ~ id               = "default/language-service" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
          ~ resource_version = "829752" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "96b8c4a4-181d-4131-8baa-79d73af0514f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "language-service"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)


                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                        # (2 unchanged blocks hidden)
                    }


                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                    # (1 unchanged block hidden)
                }
            }
            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
